/* 8.初始化用户表数据 */
INSERT INTO `users`
VALUES
 (1,'admin','a66abb5684c45962d887564f08346e8d',1,'123456',false,'2019-05-01','预留','预留'),
 (2,'superadmin','90bbb23d2b633ac4b95bcee603286e67',2,'superadmin',false,'2019-05-01','预留','预留'),
 (3,'0000123456','61e258e7ffa353476c396fdac19cfc1b',3,'0000123456',false,'2019-05-01','预留','预留'),
 (4,'123456','ea48576f30be1669971699c09ad05c94',4,'123456',false,'2019-05-01','预留','预留'),
 (5,'1111123456','f7f217ec89d2c61562519fe29a975c80',3,'1111123456',false,'2019-05-01','预留','预留'),
 (6,'2222123456','0e130665861bad4b7db057b12b7c199b',3,'2222123456',true,'2019-05-01','预留','预留');
 
 /* 9.初始化角色表数据 */
INSERT INTO `role`
VALUES
(1,'普通管理员','admin',true,'2019-05-01'),
(2,'超级管理员','superadmin',true,'2019-05-01'),
(3,'学生','student',true,'2019-05-01'),
(4,'教师','teacher',true,'2019-05-01');

/* 10.初始化权限表数据 */
INSERT INTO `permission`
VALUES
(1,'所有权限','*:*',true,'2019-05-01'),
(2,'对用户表的增加','users:add',true,'2019-05-01'),
(3,'对用户表的删除','users:delete',true,'2019-05-01'),
(4,'对用户表的修改','users:alter',true,'2019-05-01');

/* 11.初始化用户_角色表数据 */
TRUNCATE TABLE `user_roles`;
INSERT INTO `user_roles`
VALUES
 (1,1,'2019-05-01'),
 (2,2,'2019-05-01'),
 (3,3,'2019-05-01'),
 (4,4,'2019-05-01');
 
/* 12.初始化角色_权限表数据 */
TRUNCATE TABLE `roles_permissions`;
INSERT INTO `roles_permissions`
VALUES
 (1,2,'2019-05-01'),
 (1,4,'2019-05-01'),
 (2,1,'2019-05-01'),
 (3,4,'2019-05-01'),
 (4,4,'2019-05-01');